//生成卷积编码结构和生成矩阵示例
#ifndef _EXAMPLE_CPP_
#define _EXAMPLE_CPP_

#include <iostream>
#include <string>
#include <vector>
#include "classofGb.hpp"
using namespace std;

void readexample(string& ex_structure, GenMatrix& ex_GB){
    ex_structure = "\
                                                            ┌─┐        \n\
            ┌───────────────────────────────────────────────┤x│        \n\
            |                      ┌────────────────────────┤o├── v1(l)\n\
            │   ┌───┐ u1(l-1)      |      ┌─────────────────┤r│        \n\
    u1(l) ──┼───┤ d ├──────────────┤      |                 └─┘        \n\
            │   └───┘              |      |                 ┌─┐        \n\
            │                      ├──────┼─────────────────┤x│        \n\
            └────────────────────┐ |      |                 │o├── v2(l)\n\
                                 | |      |           ┌─────┤r│        \n\
                                 | |      |           |     └─┘        \n\
                                 | |      |           |     ┌─┐        \n\
                                 | └──────┼───────────┼─────┤x│        \n\
                                 └────────┼───────────┼─────┤o├── v3(l)\n\
                                          |           ├─────┤r│        \n\
                ┌───┐ u2(l-1)             |           |     └─┘        \n\
    u2(l) ──┬───┤ d ├─────────────────────┘           |                \n\
            │   └───┘                                 |                \n\
            └─────────────────────────────────────────┘                \n";

    ex_GB.n = 2; ex_GB.m = 1; ex_GB.k = 3;

    //int ex_Gbarr[2][2][3] = 
    ex_GB.Gb = 
    {{{1,0,1},{1,1,1}},
    {{0,1,1},{1,0,0}}};
}

#endif